#Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
#Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
#Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

s = int(input())
p = int(input())
x = 0
y = 0
b = 1000
for i in range(b):
    for a in range(b):    
        if i + a == s and i * a == p:
            x = i
            y = a    
            break        
print(x,y)
        